---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IPipeFittingAndAccessoryPressureDropServer Methods
IPipeFittingAndAccessoryPressureDropServer Interface See Also Send Feedback
---

The IPipeFittingAndAccessoryPressureDropServer type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Calculate | Calculate the pipe fitting and pipe accessory coefficient. |
|  | GetDataSchema | Obtains the schema of the ESEntity. |
|  | GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
|  | GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
|  | GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
|  | GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
|  | GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
|  | IsApplicable | Check if the server is applicable for the pipe fitting or pipe accessory. |

# See Also

IPipeFittingAndAccessoryPressureDropServer Interface

Autodesk.Revit.DB.Plumbing Namespace